---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ToposolidSubdivideMaterial
source: html/9b56ac4c-8763-78f5-66d3-fea4925b6c7d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ToposolidSubdivideMaterial Property

"Material"

## Syntax (C#)
```csharp
public static ForgeTypeId ToposolidSubdivideMaterial { get; }
```